package com.ll.example;

/*
public class CarEx {
    public static void main(String[] args) {
        자동차 a자동차 = new (자동차)페라리(); // 자동차 리모콘만 올 수 있음, 페라리 리모컨과 연결, 버튼 1개 제거(뚜껑_오픈 버튼 제거)
        // 자동차 a자동차 = new 페라리(); 여기선 (자동차) 생략 가능
        // a자동차는 페라리 생성자와 자동차 생성자를 갖고 있어서 형변환이 가능하다.

        페라리 a페라리 = a자동차; // 페라리 리모컨만 올 수 있음(들어갈 수 있음), 버튼 1개 추가(뚜껑-오픈 버튼 추가)
        // 자동차가 페라리가 연결되어 있을지, 스파크랑 연결되어 있을 지 모른다.
        페라리 a페라리 = (페라리)a자동차; // 그러므로 수동 형변환을 해줘야 한다.

        자동차 a자동차 = new 스파크();

    }
}
class 자동차 { // 자동차 리모컨 버튼 개수 2개
    void 감속하다() {}
}
class 페라리 extends 자동차 { // 페라리 리모컨 버튼 개수 3개
    void 뚜껑_오픈() {}
}
class 스파크 extends 자동차 {
    void 뚜껑_오픈() {}
}
*/
